In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
#creating data frame

user_data= {
    
    "MarksA":np.random.randint(1,100,5),
    "MarksB":np.random.randint(50,100,5),
    "MarksC":np.random.randint(1,100,5),
}

In [4]:
user_data

{'MarksA': array([58, 49, 87, 19, 55]),
 'MarksB': array([52, 76, 76, 85, 81]),
 'MarksC': array([31, 85, 70, 53, 71])}

In [5]:
df=pd.DataFrame(user_data,dtype='float64')

In [6]:
print(df)

   MarksA  MarksB  MarksC
0    58.0    52.0    31.0
1    49.0    76.0    85.0
2    87.0    76.0    70.0
3    19.0    85.0    53.0
4    55.0    81.0    71.0

In [7]:
df.head() #if we pass n(integer) in this it will print only n rows of the data frame

   MarksA  MarksB  MarksC
0    58.0    52.0    31.0
1    49.0    76.0    85.0
2    87.0    76.0    70.0
3    19.0    85.0    53.0
4    55.0    81.0    71.0

In [8]:
df.columns=['A','B','C']

In [9]:
df

      A     B     C
0  58.0  52.0  31.0
1  49.0  76.0  85.0
2  87.0  76.0  70.0
3  19.0  85.0  53.0
4  55.0  81.0  71.0

In [10]:
#making csv from dataframe

In [11]:
df.to_csv('dataframetoCsv.csv')

In [12]:
my_data=pd.read_csv('dataframetoCsv.csv')

In [13]:
my_data

   Unnamed: 0     A     B     C
0           0  58.0  52.0  31.0
1           1  49.0  76.0  85.0
2           2  87.0  76.0  70.0
3           3  19.0  85.0  53.0
4           4  55.0  81.0  71.0

In [14]:
my_data=my_data.drop(columns=['Unnamed: 0']) #to remove a specific column

In [17]:
my_data

      A     B     C
0  58.0  52.0  31.0
1  49.0  76.0  85.0
2  87.0  76.0  70.0
3  19.0  85.0  53.0
4  55.0  81.0  71.0

In [18]:
my_data.describe()

              A          B         C
count   5.00000   5.000000   5.00000
mean   58.80000  75.400000  54.40000
std    36.29325  11.886968  31.73799
min    11.00000  57.000000  16.00000
25%    29.00000  70.000000  24.00000
50%    79.00000  81.000000  73.00000
75%    83.00000  84.000000  76.00000
max    92.00000  85.000000  83.00000

In [21]:
my_data.tail(n=3) #show from last

      A     B     C
2  83.0  85.0  73.0
3  29.0  81.0  24.0
4  79.0  84.0  76.0

In [22]:
#for accesing rows
my_data.iloc[3]

A    29.0
B    81.0
C    24.0
Name: 3, dtype: float64

In [23]:
#row,col
my_data.iloc[3,1]

81.0

In [19]:
idx=df.columns.get_loc("B") #idx can also be a list and passed in iloc
df.iloc[3,idx]

85.0